<script setup>
import CardSeasons from "../components/CardSeasons.vue";
import { onMounted, ref } from "vue";

let cards = ref([
  {
    img: "https://images-s.kinorium.com/movie/poster/2388029/w1500_50894083.jpg",
    title: "1-й сезон",
    desc: "<br/>«Обычный парень проглотил палец демона — и мир треснул по швам.»<br/><br/>Старшеклассник Юдзи Итадори, обладающий нечеловеческой силой, даже не думал становиться магом. Но когда палец величайшего проклятия в истории — Рёмена Сукуны — оказывается у него в руке, а монстры из человеческих страхов нападают на школу, выбора не остаётся.<br/>Теперь он — сосуд Короля Проклятий. За ним охотятся, его хотят казнить, но один человек даёт шанс: Сатору Годзё, сильнейший маг современности.<br/>Вместе с молчаливым бойцом Мэгуми Фусигуро и одержимой деньгами Нобарой Кугисаки Юдзи предстоит узнать, что магия — это не заклинания и жесты. Это борьба со тьмой, которая живёт в каждом человеке. И иногда единственный способ победить зло — самому стать монстром."
  },
  {
    img: "https://images-s.kinorium.com/movie/poster/2388029/w1500_51657795.jpg",
    title: "Фильм «Магическая битва 0»",
    desc: "<br/>«Любовь — самое извращённое проклятие.»<br/><br/>Год назад до событий первого сезона. Юта Оккоцу, мальчик, которого прокляла его умершая возлюбленная Рика, приходит в Технику магии. Он сломлен, опасен и готов к смертной казни.<br/>Но Годзё видит иначе: он даёт Юте друзей — энергичную Маки Дзэнин, безумного Тогэ Инумаки (который говорит только рисовыми онигири), и тихого эксперта по проклятиям Панду.<br/>Их цель — проклятый пользователь Сугуру Гэто, который мечтает истребить всех обычных людей и создать мир только для магов. Финальная битва в Киото решит судьбу всего мира магии.<br/>Вопрос только в одном: кем станет Юта — спасителем или величайшим проклятием в истории?",
  },
  {
    img: "https://images-s.kinorium.com/movie/poster/2388029/w1500_52040724.jpg ",
    title: "2-й сезон",
    desc: "<br/>«Сильнейший пал. Наступило время самых безумных.»<br/><br/>Арка «Прошлое» (5 эпизодов):<br/><br/>Лето 2006 года. Молодой Сатору Годзё — высокомерный гений, которого ничто не волнует. Юный Сугуру Гэто — идеалист, который хочет спасать слабых. Вместе они получают задание защитить девушку Руко, которая должна слить свою силу в жертвоприношении.<br/>Но всё идёт не по плану. Один день забирает всё: веру, дружбу и человечность. Ты узнаешь, как Годзё стал Сильнейшим — и как Гэто стал Злейшим.<br/><br/>Арка «Хибашский инцидент» (остальные эпизоды):<br/>  <br/>Нашёлся тот, кто смог запечатать Годзё. Мир магии рухнул. Полчища проклятий заливают Киото. Друзья Юдзи разбросаны, ранены, теряют близких.<br/>Мэгуми идёт на сделку с дьяволом. Нобара совершает невозможное. А Юдзи... Юдзи впервые в жизни понимает, что может проиграть по-настоящему.<br/>Это не сезон побед. Это сезон, где выживание — уже победа.",
  },
  {
    img: "https://images-s.kinorium.com/movie/poster/2388029/w1500_55553569.jpg",
    title: "3-й сезон",
    desc: "<br/>«Годзё в клетке. Правил больше нет. Выживает сильнейший.»<br/><br/>После ада в Сибуе мир магов рухнул. Годзё запечатан в Темнице. Юдзи — враг общества номер один, приговорённый к казни. Общество магов разодрано кланами, каждый гребёт власть под себя.<br/><br/>Но это только начало.<br/><br/>Кэндзяку — древний колдун в теле Гэто — запускает свою главную партию: **Игру на выбывание**. Смертельный турнир по всей Японии, где маги сражаются в закрытых колониях. Правила просты: убивай противников, получай очки, меняй правила игры. Выхода нет. Сдаваться нельзя. Единственный способ выжить — стать сильнейшим.<br/><br/>Арка «Казнь Юдзи»:**<br/><br/>Сериал открывается тем, что Юта Оккоцу — герой «0», который клялся защищать Юдзи — настигает его и пронзает сердце. Казнь выглядит реальной. Друзья в шоке. Зритель в шоке. Но за этим стоит величайший обман: Юта, связанный клятвой руководству, формально исполнил приговор, но воскресил Юдзи своей Обратной Проклятой Техникой. Пока Юдзи приходит в себя, Чосо разбирается с Наоей Зэнином — и это не битва, а избиение.<br/><br/>Арка «Быть во всеоружии»:**<br/><br/>Подготовка к турниру. Мэгуми собирает союзников — включая опального мага Киндзи Хакари, который в пике своей силы сильнее Годзё. А Маки Зэнин возвращается в родной клан, чтобы забрать проклятое оружие. И отомстить. Результат: клан Зэнин уничтожен за одну ночь — руками той, кого считали никчёмной. Это не месть. Это экзекуция.<br/><br/>Арка «Игра на выбывание»:**<br/><br/>Герои входят в колонии. Юдзи против Хироми Хигурумы — гения-адвоката, чья техника превращает бой в судебное заседание. Юдзи обвиняют в массовом убийстве в Сибуе. Вердикт решит не только его судьбу, но и ход всей игры. Мэгуми против Реджи Стара — битва не силой, а интеллектом и волей. Он впервые использует Незавершённое Расширение Поля — плату за победу, которая подтачивает его изнутри. А Юта в Сендайской колонии дерётся один против трёх древних магов-реинкарнаций. Масштаб не хуже Сибуи, но это только разминка.<br/><br/>Это не сезон надежды. Это сезон, где каждый победитель чуть больше похож на монстра, а Годзё всё ещё за печатью.",
  },
]);
</script>

<template>
  <section>
    <CardSeasons v-for="(card, i) in cards" :key="i" :card="card" />
  </section>
</template>

<style scoped>
section {
  display: grid;
  gap: 40px;
}
</style>
